app/controllers/api/artists_controller.rb

    def create
        @artist = Artist.new(artist_params)

        if @artist.save
---
INSERT INTO "artists" ("username", "email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"