app/controllers/application_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."session_token" = $1 LIMIT $2  [["session_token", "S99LPc1h1DFQkoDJf63Hjw"], ["LIMIT", 1]]
---
    def current_user
        @current_user ||= Artist.find_by(session_token: session[:session_token])