app/models/artist.rb

    def self.find_by_credentials(un, pw)
        @artist = Artist.find_by(username: un)
---
SELECT  "artists".* FROM "artists" WHERE "artists"."username" = $1 LIMIT $2  [["username", "123"], ["LIMIT", 1]]

    def reset_session_token!
        self.session_token = SecureRandom::urlsafe_base64
        self.save!
---
UPDATE "artists" SET "session_token" = $1, "updated_at" = $2 WHERE "artists"."id" = $3  [["session_token", "S99LPc1h1DFQkoDJf63Hjw"], ["updated_at", "2020-10-13 19:48:35.267572"], ["id", 2]]